In [5]:
import numpy as np 
import pandas as pd

# Pandas Basics

In [22]:
dict1 = {
    "name": ['Harsh', 'Rahul', 'Vineet', 'Shanaya', 'Raj', 'Sahil', 'Joy', 'Sandeep'],
    "marks": [87, 95, 15, 67, 96, 98, 50, 88],
    "city": ['Delhi', 'Kolkata', 'Lucknow', 'Bangalore', 'Goa', 'Bhilwara', 'Rampur', 'Varanasi']
}

In [23]:
# DataFrame is a two-dimensional, tabular data structure with labeled axes (rows and columns) 
# and is similar to a spreadsheet or SQL table. The pandas library is widely used for 
# data manipulation and analysis, and the DataFrame is one of its key components.

df = pd.DataFrame(dict1)

In [24]:
# displaying content in tabular form
df

      name  marks       city
0    Harsh     87      Delhi
1    Rahul     95    Kolkata
2   Vineet     15    Lucknow
3  Shanaya     67  Bangalore
4      Raj     96        Goa
5    Sahil     98   Bhilwara
6      Joy     50     Rampur
7  Sandeep     88   Varanasi

In [25]:
# importing to csv
df.to_csv('students.csv')

In [26]:
# importing to csv (with no index)
df.to_csv('students_noindex.csv', index=False)

In [30]:
# head() method displays top 5 rows from top
df.head()

      name  marks       city
0    Harsh     87      Delhi
1    Rahul     95    Kolkata
2   Vineet     15    Lucknow
3  Shanaya     67  Bangalore
4      Raj     96        Goa

In [31]:
# we can also specify how many rows we want from top
df.head(2)

    name  marks     city
0  Harsh     87    Delhi
1  Rahul     95  Kolkata

In [32]:
# tail() method is used to display 5 rows from bottom
df.tail()

      name  marks       city
3  Shanaya     67  Bangalore
4      Raj     96        Goa
5    Sahil     98   Bhilwara
6      Joy     50     Rampur
7  Sandeep     88   Varanasi

In [34]:
# SAME PROPERTY AS OF head()
df.tail(3)

      name  marks      city
5    Sahil     98  Bhilwara
6      Joy     50    Rampur
7  Sandeep     88  Varanasi

In [36]:
# describe() method displays some statistical values of columns containing numbers
df.describe()

           marks
count   8.000000
mean   74.500000
std    29.203718
min    15.000000
25%    62.750000
50%    87.500000
75%    95.250000
max    98.000000